Exp3/QuickSort.tex
% Created 2026-01-11 Sun 22:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Saravana Senthilkumar - 3122247001057}
\date{\today}
\title{Experiment 3 - Divide and Conquer (Quick Sort, Nuts and Bolts)}
\hypersetup{
 pdfauthor={Saravana Senthilkumar - 3122247001057},
 pdftitle={Experiment 3 - Divide and Conquer (Quick Sort, Nuts and Bolts)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Partitioning the Array}
\label{sec:org3801ff3}

Define a function partition1 (a, low, high)


\begin{verbatim}

def partition1(a, low, high):
    pivot = a[high]
    i = low
    j = high - 1

    while i <= j:
        if a[i] < pivot:
            i += 1
        else:
            a[i], a[j] = a[j], a[i]
            j -= 1
    a[i], a[high] = a[high], a[i]
    return i


print(partition1([7,5,8,2,3,6], 0, 5))

\end{verbatim}
\section{Quick Sort using the partition function}
\label{sec:org8d4a8bb}

\begin{verbatim}

def QuickSort(a, low, high):
    if low < high:

        p = partition1(a,low,high)
        QuickSort(a, low, p-1)
        QuickSort(a, p+1, high)
        return a


print(QuickSort([7,5,8,2,3,6], 0,5))

\end{verbatim}
\section{Match Nuts and Bolts}
\label{sec:org225cdcc}

Find if a Nut matches a bolt in O(n\textsuperscript{2})

\begin{verbatim}

def find(a, b, low, high):
    lpair = []
    for i in range(low, high):
        for j in range(low, high):
            if a[i] == b[j]:
                lpair += [[i,j]]
                break
    return lpair

a = [1,2,3,4,5]
b = [2,4,6,8,10]

x = find(a, b, 0, 5)
print("Matching Nuts and Bolts (Index of Pair): ", end='')
print(x)

\end{verbatim}


Find pivot value of bolt and partition the nut list

\begin{verbatim}

def partition(arr, low, high, piv):
    i = low
    for j in range(low, high):
        if arr[j] < piv:
            arr[i], arr[j] = arr[j], arr[i]
            i += 1
        elif arr[j] == piv:
            arr[j], arr[high] = arr[high], arr[j]
            j -= 1
    arr[i], arr[high] = arr[high], arr[i]
    return i

a = [4,2,3,1,5]
b = [2,4,1,3,5]
print("Pivot: ", partition(a, 0, 4, 4))

\end{verbatim}

Sort Nuts and Bolts recursively

\begin{verbatim}
def sort(a, b, low, high):
    if low < high:
        pn = partition(a, 0,4,b[high])
        pb = partition(b, 0, 4,a[pn])
        sort(a,b,0,pn-1)
        sort(a,b,pn+1,high)
        # print(a) # Nut
        # print(b) # Bolt

a = [4,2,3,1,5]
b = [2,4,1,3,5]
sort(a,b, 0, 4)
print("Nuts : ", a)
print("Bolts: ", b)
\end{verbatim}
\end{document}
